Repository: Finb/Bark
Catalog: Bark/*.lproj/Localizable.strings
Languages: tr, zh_hans

# SecureConnection
source: Secure Connection (HTTPS)
tr: Güvenli Bağlantı (HTTPS)
zh_hans: HTTPS安全连接

# InsecureConnection
source: Insecure Connection (HTTP)
tr: Güvensiz Bağlantı (HTTP)
zh_hans: 连接不安全，请使用HTTPS安全连接

source: Register Device
tr: Cihazı Kaydet
zh_hans: 注册设备

# CustomedNotificationContent
source: Body Text
tr: Gövde Metni
zh_hans: 这里改成你自己的推送内容

# CustomedNotificationTitle
source: Title
tr: Başlık
zh_hans: 推送标题

# Notice1
source: Use the buttons to copy and open sample URLs
tr: Örnek URL'leri kopyalamak ve açmak için düğmeleri kullanın
zh_hans: 点击右上角按钮可以复制测试URL、预览推送效果 Safari有缓存，没收到推送时请刷新页面

# Notice2
source: Customize notification title and body text
tr: Bildirim başlığını ve gövde metnini özelleştirme
zh_hans: 推送标题的字号比推送内容粗一点

# Copy
source: Copied!
tr: Kopyalandı!
zh_hans: 复制成功

# Copy2
source: Copy
tr: Kopyala
zh_hans: 复制

source: Copy All
tr: Tümünü Kopyala
zh_hans: 复制全部内容

# CopyContent
source: Copy the Content
tr: İçeriği Kopyala
zh_hans: 复制内容

source: Cancel
tr: Vazgeç
zh_hans: 取消

source: More Actions
tr: Daha Fazla İşlem

# AllowNotifications
source: Notifications have been turned off. Please allow notifications in the Settings app.
tr: Bildirimler kapatıldı. Lütfen Ayarlar uygulamasından bildirimlere izin verin.
zh_hans: 绑定设备需要推送。请打开推送后重试

source: Unregistered Device
tr: Kayıtsız Cihaz
zh_hans: 设备未注册，不能使用推送服务

source: Server Error
tr: Sunucu Hatası
zh_hans: 服务器错误，不能使用推送服务

source: Server Address
tr: Sunucu Adresi
zh_hans: 服务器地址

# ServerExample
source: Enter the server address, e.g., https://api.day.app
tr: Sunucu adresini girin, örneğin, https://api.day.app
zh_hans: 输入服务器地址，例如: https://api.day.app

# DeploymentDocuments
source: Deploy a self-hosted Bark server
tr: Sunucu tarafı dağıtım dökümanını görüntüleyin
zh_hans: 查看服务端部署教程

# AddServer
source: Add a Server
tr: Sunucu Ekleme
zh_hans: 添加私有服务器

# AddedSuccessfully
source: Server has been added successfully.
tr: Sunucu başarıyla eklendi.
zh_hans: 修改成功!

# InvalidServer
source: Server address is invalid.
tr: Sunucu adresi geçersiz.
zh_hans: 填写的服务器无效，请重试!

# InvalidURL
source: URL is invalid.
tr: URL geçersiz.
zh_hans: 输入的URL好像不对劲!

# urlParameter
source: Open an URL by clicking on a notification, URL schemes are supported.
tr: Bir bildirime tıklayarak bir URL açın, URL şemaları desteklenir.
zh_hans: 携带url参数时，点击推送会跳转到这个URL,支持跳转URL Scheme

# copyParameter
source: Specify clipboard content by passing through the 'copy' parameter
tr: 'copy' parametresini geçirerek pano içeriğini belirtin
zh_hans: 下拉推送、锁屏界面左滑查看推送时，可以选择复制推送内容 携带copy参数时，将只复制copy参数的值

# automaticallyCopyTitle
source: Auto Copy Body Text (iOS 14.4 and below)
tr: Gövde Metnini Otomatik Kopyala (iOS 14.4 ve altı)
zh_hans: 自动复制推送内容到剪切板

# automaticallyCopy
source: Automatically copy the body text of a notification, only for iOS 14.4 and below. For iOS 14.5 and above, long press or pull down the notification to copy.
tr: Bir bildirimin gövde metnini otomatik olarak kopyalayın, yalnızca iOS 14.4 ve altı için. iOS 14.5 ve üzeri sürümlerde, kopyalamak için bildirime uzun basın veya aşağı çekin.
zh_hans: 携带automaticallyCopy参数时，将自动复制推送内容。 携带copy参数时，将只复制copy参数的值。 iOS14.5 之后长按或下拉推送即可触发自动复制，iOS14.5之前无需任何操作即可自动复制。

# historyMessage
source: Message History
tr: Mesaj Geçmişi
zh_hans: 历史消息

# unknown
source: Unknown Status
tr: Bilinmeyen Durum
zh_hans: 未知

# available
source: Enabled
tr: Etkin
zh_hans: 已开启

# restricted
source: Disabled
tr: Devre Dışı
zh_hans: 未开启

source: Settings
tr: Ayarlar
zh_hans: 设置

# iCloudSatatus
source: iCloud Sync
tr: iCloud Senkronizasyonu
zh_hans: iCloud 同步

# iCloudSync
source: Sync notifications through iCloud
tr: Bildirimleri iCloud aracılığıyla senkronize edin
zh_hans: 通知消息将在iCloud可用时同步

# defaultArchiveSettings
source: Archive by Default
tr: Varsayılan Olarak Arşivle
zh_hans: 默认保存

# archiveNote
source: Archive notifications by default if the 'isArchive' parameter is unset.
tr: 'isArchive' parametresi ayarlanmamışsa varsayılan olarak bildirimleri arşivleyin.
zh_hans: 当推送请求URL没有指定 isArchive 参数时，将按照此设置来决定是否保存通知消息

# archiveNotificationMessageTitle
source: Archive Notification
tr: Arşiv Bildirimi
zh_hans: 自动保存通知消息

# archiveNotificationMessage
source: Archive a notification by passing 'isArchive=1'. Prevent archiving by passing 'isArchive=0'. Default settings will apply if the parameter is unset.
tr: 'isArchive=1' değerini geçerek bir bildirimi arşivleyin. 'isArchive=0' geçerek arşivlemeyi önleyin. Parametre ayarlanmamışsa varsayılan ayarlar geçerli olacaktır.
zh_hans: 当设置 isArchive 值为 1 时，则会自动保存这条推送消息，设置为其他值时，则不会保存。 如果不指定 isArchive 参数时，则按照默认设置保存消息，可以在 设置->默认保存消息 更改默认保存设置

# notificationSound
source: Alert Sound
tr: Uyarı Sesi
zh_hans: 推送铃声

# previewSound
source: Click to Play
tr: Oynamak için Tıklayın
zh_hans: 点击可预览

# setSounds
source: Select an alert sound for a notification.
tr: Bildirim için bir uyarı sesi seçin.
zh_hans: 可以为推送设置不同的铃声

# viewAllSounds
source: Click here to view all available sounds.
tr: Mevcut tüm sesleri görüntülemek için buraya tıklayın.
zh_hans: 查看所有铃声

source: Service
tr: Hizmet
zh_hans: 服务器

# lastHour
source: The last hour
tr: Son bir saat
zh_hans: 过去一小时

source: Today
tr: Bugün
zh_hans: 今天

source: Today and yesterday
tr: Dün ve Bugün
zh_hans: 昨天和今天

source: All time
tr: Tüm zamanlar
zh_hans: 所有时间

source: Clear from:
tr: Şuradan Temizle:
zh_hans: 清除以下时间段的历史消息:

source: Clear
tr: Temizle
zh_hans: 清除

# group
source: Groups
tr: Gruplar
zh_hans: 群组

source: Done
tr: Bitti
zh_hans: 完成

source: Default
tr: Varsayılan
zh_hans: 默认

# hideAllGroups
source: Unselect All Groups
tr: Tüm Grupların Seçimini Kaldır
zh_hans: 取消所有选择

# showAllGroups
source: Select All Groups
tr: Tüm Grupları Seç
zh_hans: 选择所有群组

# groupMessagesNotice
source: Let iOS sort notifications by groups.
tr: iOS'un bildirimleri gruplara göre sıralamasına izin verin.
zh_hans: 对消息进行分组，推送将按group分组显示在通知中心中。 也可在历史消息列表中选择查看不同的群组。

# messageGroup
source: Notification Grouping
tr: Bildirim Gruplandırma
zh_hans: 推送消息分组

source: Info
tr: Bilgi
zh_hans: 信息

# buildDesc
source: Bark uses GitHub Actions to build and publish itself to the App Store. You can verify the ‘run_id’ in the URL to ensure Bark was built from its original open-source codebase.
tr: Bark, kendisini oluşturmak ve App Store'da yayınlamak için GitHub Actions'ı kullanır. Bark'ın orijinal açık kaynak kod tabanından oluşturulduğundan emin olmak için URL'deki 'run_id'yi doğrulayabilirsiniz.
zh_hans: Bark 由 GitHub Actions 构建后上传到 App Store，此信息可帮助你确认当前版本是由开源代码所构建，未经任何人(包含作者)修改。

source: Other
tr: Diğer
zh_hans: 其他

# faq
source: FAQs
tr: SSS
zh_hans: 常见问题

# appSC
source: App Source Code
tr: Uygulama Kaynak Kodu
zh_hans: App源代码

# backendSC
source: Backend Source Code
tr: Arka Uç Kaynak Kodu
zh_hans: 后端源代码

# notificationIcon
source: Icon
tr: İkon
zh_hans: 自定义推送图标（需iOS15或以上）

# notificationIconNotice
source: Display a custom icon on a notification.
tr: Bildirimde özel bir ikon görüntüleyin.
zh_hans: 为推送设置自定义图标，设置的图标将替换默认Bark图标。图标会自动缓存在本机，相同的图标 URL 仅下载一次。

# interruptionLevel
source: Time Sensitive Notifications
tr: Zamana Duyarlı Bildirimler
zh_hans: 时效性通知

# interruptionLevelNotice
source: Set importance and delivery timing of a notification. Available values: active (default): presents the notification immediately, lights up the screen, and can play a sound. timeSensitive: similar to active, but can break through system controls such as Notification Summary and Focus. passive: adds the notification to the notification list without lighting up the screen or playing a sound.
tr: Bir bildirimin önemini ve teslim zamanlamasını ayarlayın. Kullanılabilir değerler: active (varsayılan): bildirimi hemen sunar, ekranı aydınlatır ve bir ses çalabilir. timeSensitive: aktif'e benzer, ancak Bildirim Özeti ve Odak gibi sistem denetimlerini aşabilir. passive: bildirimi ekranı aydınlatmadan veya bir ses çalmadan bildirim listesine ekler.
zh_hans: 可对通知设置中断级别，不设置则默认为 active。 可选参数值： active： 默认值，系统会立即亮屏显示通知。 timeSensitive：时效性通知，可在专注状态下显示通知。 passive：仅将通知添加到通知列表，不会亮屏提醒。

# badge
source: Badge Count
tr: Rozet Sayısı
zh_hans: 设置角标

# badgeNotice
source: Specify a number on Bark app’s icon when a notification arrives.
tr: Bir bildirim geldiğinde Bark uygulamasının simgesinde bir sayı belirtin.
zh_hans: 可以为推送设置角标，角标可以是任意数字。

# deviceTokenInfo
source: Token for APNs. Click to copy.
tr: APNs için token. Kopyalamak için tıklayın.
zh_hans: 苹果推送的真实设备 Token ，请勿泄露，点击可复制到剪切板。

source: Server List
tr: Sunucu Listesi
zh_hans: 服务器列表

source: Copy Address and Key
tr: Adres ve Anahtarı Kopyala
zh_hans: 复制地址和Key

# resetKey
source: Reset or Restore Key
tr: Anahtarı Sıfırla veya Geri Yükle
zh_hans: 重置或还原Key

# resetKeyDesc
source: Leave blank to reset. Enter an old key to restore.
tr: Sıfırlamak için boş bırakın. Geri yüklemek için eski bir anahtar girin.
zh_hans: 重置直接点确定，还原请先输入旧的Key

source: Confirm
tr: Onayla
zh_hans: 确定

source: Delete Server
tr: Sunucuyu Sil
zh_hans: 删除服务器

# confirmDeleteServer
source: Are you sure you want to delete this server?
tr: Bu sunucuyu silmek istediğinizden emin misiniz?
zh_hans: 确定删除服务器吗？

# deleteFailed
source: You must have at least one server configured.
tr: Yapılandırılmış en az bir sunucunuz olmalıdır.
zh_hans: 不能删除，服务器至少需保留一个

# deletedSuccessfully
source: Server has been deleted successfully.
tr: Sunucu başarıyla silindi.
zh_hans: 删除成功

source: Reset Failed
tr: Sıfırlama Başarısız Oldu
zh_hans: 重置失败

# resetFailed2
source: Bark could not get a DeviceToken from the server.
tr: Bark sunucudan bir DeviceToken alamadı.
zh_hans: 重置失败，没有获取到 DeviceToken

source: Export
tr: Dışa Aktar
zh_hans: 导出

source: Import
tr: İçe Aktar
zh_hans: 导入

# exportOrImport
source: Export and import messages
tr: Mesajları dışa ve içe aktarma
zh_hans: 导出或导入消息列表

# items
source: messages
tr: mesajlar
zh_hans: 条消息

# enterKey
source: Please enter %d-bytes Key
tr: Lütfen %d-bit Anahtar girin
zh_hans: 请输入%d位Key

# enterIv
source: Please enter %d-bytes Iv
tr: Lütfen 16 bit Iv girin
zh_hans: 请输入16位Iv

source: Encryption Settings
tr: Şifreleme Ayarları
zh_hans: 加密设置

source: Algorithm
tr: Algoritma
zh_hans: 算法

source: Mode
tr: Mod
zh_hans: 模式

# copyExample
source: Copy Send Script Example
tr: Kopya Gönderme Komut Dosyası Örneği
zh_hans: 复制发送脚本示例

source: Preview
tr: Önizleme
zh_hans: 预览

source: Push Notification Encryption
tr: Anlık Bildirim Şifreleme
zh_hans: 推送加密

# encryptionNotice
source: Uses a custom key to encrypt and decrypt the push content when sending and receiving. In this way, the push content will not be obtained or leaked by Bark server and Apple APNs server during transmission.
tr: Gönderirken ve alırken push içeriğini şifrelemek ve şifresini çözmek için özel bir anahtar kullanır. Bu sayede push içeriği iletim sırasında Bark sunucusu ve Apple APNs sunucusu tarafından elde edilemez veya sızdırılamaz.
zh_hans: 在发送和接收推送时，对推送内容进行加密和解密。这样，推送内容在传输过程中就不会被 Bark 服务器和苹果 APNs 服务器获取或泄露，从而保护你的隐私

# faqUrl
source: https://bark.day.app/#/en-us/faq
tr: https://bark.day.app/#/tr/faq
zh_hans: https://bark.day.app/#/faq

# docUrl
source: https://bark.day.app/#/en-us/?id=bark
tr: https://bark.day.app/#/tr/?id=bark
zh_hans: https://bark.day.app/#/?id=bark

# encryptionUrl
source: https://bark.day.app/#/en-us/encryption
tr: https://bark.day.app/#/tr/encryption
zh_hans: https://bark.day.app/#/encryption

# deployUrl
source: https://bark.day.app/#/en-us/deploy
tr: https://bark.day.app/#/tr/deploy

source: Documentation
tr: Dokümantasyon
zh_hans: 使用文档

# ivComment
source: IV can be randomly generated, but if it is random, it needs to be passed in the iv parameter.
tr: IV rastgele oluşturulabilir, ancak rastgele ise iv parametresinde belirtilmesi gerekir.
zh_hans: IV可以是随机生成的，但如果是随机的就需要放在 iv 参数里传递。

# opensslEncodingComment
source: openssl requires Hex encoding of manual keys and IVs, not ASCII encoding.
tr: openssl, manuel anahtarların ve IV'lerin ASCII kodlamasını değil, Hex kodlamasını gerektirir.
zh_hans: OpenSSL 要求输入的 Key 和 IV 需使用十六进制编码。

# ciphertextComment
source: URL encoding the ciphertext, there may be special characters.
tr: URL şifreli metni kodlarken özel karakterler olabilir.
zh_hans: 密文可能有特殊字符，所以记得 URL 编码一下。

# consoleComment
source: The console will print
tr: Konsola şunları yazdırır
zh_hans: 控制台将打印

# keyComment
source: Must be %d bit long
tr: %d bit uzunluğunda olmalıdır
zh_hans: 必须%d位

# removeMessage
source: Remove
tr: Sil

# timeJustNow
source: Just now
tr: Az önce

# timeMinAgo
source: %1$d minute ago
tr: %1$d dakika önce

# timeHourAgo
source: %1$d hour ago
tr: %1$d saat önce

# timeMinHourAgo
source: %1$d hour %2$d minutes ago
tr: %1$d saat %2$d dakika önce

# crashContent
source: If the app keeps crashing repeatedly, you can try to uncheck Bark in System Settings -> iCloud -> Apps Using iCloud. (The path may vary slightly depending on the system version.) If the problem persists, you can try to check the FAQ to see if there is a solution. https://bark.day.app/#/en-us/faq If you need help, you can also send the crash log to me, and I will contact you as soon as possible. Email: to@day.app Telegram: https://t.me/joinchat/OsCbLzovUAE0YjY1 Github Issue: https://github.com/Finb/Bark/issues
tr: If the app keeps crashing repeatedly, you can try to uncheck Bark in System Settings -> iCloud -> Apps Using iCloud. (The path may vary slightly depending on the system version.) If the problem persists, you can try to check the FAQ to see if there is a solution. https://bark.day.app/#/tr/faq If you need help, you can also send the crash log to me, and I will contact you as soon as possible. Email: to@day.app Telegram: https://t.me/joinchat/OsCbLzovUAE0YjY1 Github Issue: https://github.com/Finb/Bark/issues
